UserHackable/Phototherapy_Timer/esp32_firmware/apps/session_timer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# LAN NTP + public fallbacks (session_timer SNTP_SERVER_*)
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Dual OTA on 4MB (see esp32_firmware/partitions/partitions_two_ota_4mb.csv).
# Partition-table changes require a full USB flash (not app-only OTA).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions/partitions_two_ota_4mb.csv"
# LAN OTA: plain HTTP + SHA-256 integrity (private LAN only).
CONFIG_OTA_ALLOW_HTTP=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
# Bootloader rolls back if the app never marks itself valid.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
